//-----------------------------------------------------------------------------
// UIベースクラス
//-----------------------------------------------------------------------------
#include "UIBase.h"

//-----------------------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------------------
UIBase::UIBase()
{
	// 処理なし
}

//-----------------------------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------------------------
UIBase::~UIBase()
{
	// 処理なし
}

//-----------------------------------------------------------------------------
// 生成
//-----------------------------------------------------------------------------
void UIBase::Create()
{
	p_uiControll = new UIControll();
	p_miniMap = new MiniMapControll();
}

//-----------------------------------------------------------------------------
// 削除
//-----------------------------------------------------------------------------
void UIBase::Delete()
{
	delete(p_uiControll);
	delete(p_miniMap);
}

//-----------------------------------------------------------------------------
// 初期化
//-----------------------------------------------------------------------------
void UIBase::Init()
{
	p_uiControll->Init();
	p_miniMap->Init();
}

//-----------------------------------------------------------------------------
// 更新
//-----------------------------------------------------------------------------
void UIBase::Update()
{
	if (m_nowScene == TITLE)
	{
		p_uiControll->UpdateTitle();
	}
	else if (m_nowScene == PLAY)
	{
		p_uiControll->UpdatePlay();
	}
}

//-----------------------------------------------------------------------------
// 描画
//-----------------------------------------------------------------------------
void UIBase::Draw()
{
	if (m_nowScene == TITLE)
	{
		p_uiControll->DrawTitle();
	}
	else if (m_nowScene == SELECT)
	{
		p_uiControll->DrawSelect();
	}
	else if (m_nowScene == PLAY)
	{
		p_miniMap->Draw();
		p_uiControll->DrawPlay();
	}
}


// ミニマップに必要な情報のSet関数
void UIBase::SetMiniMapInfo(int i, VECTOR cubePos, VECTOR playerPos, VECTOR dirPos, bool isSupport)
{
	p_miniMap->SetCubePos(i, cubePos);
	p_miniMap->SetPlayerPos(playerPos);
	p_miniMap->SetDirPos(dirPos);

	if (isSupport)
	{
		p_miniMap->SetIsSupport(true);
	}
	else
	{
		p_miniMap->SetIsSupport(false);
	}
}
